HW11/app/views/carts/show.html.erb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = $1  [["cart_id", 8]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = $1 LIMIT $2  [["cart_id", 8], ["LIMIT", 1]]
---
<% if current_cart.lineitems.any? %>