HW14/app/mailers/user_mailer.rb

  def send_order(user, order)
    @user = user
    @order = order
    order.cart.lineitems.each do |line_item|
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = $1  [["cart_id", 2]]