HW10/app/controllers/products_controller.rb

  def index
    @products = Product.all
    @categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

  def show
    @product = Product.find(params[:id])
    @categories = Category.all
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"