HW15/app/admin/products.rb

      f.input :name
      f.input :description
      f.input :price
      f.input :category_id, as: :select, collection: Category.all.map { |c| [c.title, c.id] }
---
SELECT "categories".* FROM "categories"