HW15/app/controllers/lineitems_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    product = Product.find(params[:product_id])

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lineitems" WHERE "lineitems"."id" = $1  [["id", 2]]
---
  def destroy
    lineitem = Lineitem.find(params[:id])
    lineitem.destroy

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "lineitems" SET "quantity" = $1, "updated_at" = $2 WHERE "lineitems"."id" = $3  [["quantity", 2], ["updated_at", "2023-01-04 22:24:48.535852"], ["id", 1]]
---
  def add_quantity
    lineitem = Lineitem.find(params[:id])
    lineitem.quantity += 1
    lineitem.save

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "lineitems" SET "quantity" = $1, "updated_at" = $2 WHERE "lineitems"."id" = $3  [["quantity", 3], ["updated_at", "2023-01-04 22:24:50.601883"], ["id", 1]]
---
  def reduce_quantity
    lineitem = Lineitem.find(params[:id])
    if lineitem.quantity > 1
      lineitem.quantity -= 1
    end
    lineitem.save