HW6/app/controllers/api/v1/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Jorge 3"], ["body", "body my body"], ["created_at", "2022-11-30 14:28:11.863369"], ["updated_at", "2022-11-30 14:28:11.863369"], ["author_id", 3]]
---
  def create
    @article = @author.articles.new(article_params)

    if @article.save

UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "body my body 2"], ["updated_at", "2022-11-30 14:28:28.219161"], ["id", 1]]
---
  def update
    if @article.update(article_params)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_author
    @author = Author.find(params[:author_id])