HW6/app/controllers/api/v1/comments_controller.rb

  def set_author
    @author = Author.find(params[:author_id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]