HW5/app/controllers/api/v1/articles_controller.rb

UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "My title 3"], ["body", "Its body 3"], ["updated_at", "2022-11-20 11:04:57.480057"], ["id", 3]]
---
  def update
    if @article.update(article_params)