HW8/app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT "articles".* FROM "articles" WHERE (title LIKE '%titl%' OR body LIKE '%titl%')
---
  def index
    articles = if params[:search].blank?
                 Article.all
               else
                 Article.where('title LIKE ? OR body LIKE ?', "%#{params[:search]}%", "%#{params[:search]}%")

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "My title"], ["body", "My body"], ["created_at", "2022-12-14 14:00:18.393539"], ["updated_at", "2022-12-14 14:00:18.393539"], ["author_id", 1], ["status", 0]]
---
  def create
    @article = @author.articles.new(article_params)

    if @article.save

UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "My title (new)"], ["body", "My body (new)"], ["updated_at", "2022-12-10 14:07:47.017248"], ["id", 1]]
---
  def update
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
  def destroy
    if @article.destroy

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_author
    @author = Author.find(params[:author_id])