HW11/app/models/cart.rb

  def add_product(product)
    line_item = lineitems.find_by(product: product)
    if line_item and product.price == line_item.price
      line_item.quantity = line_item.quantity + 1
      line_item.save
    else
      lineitems.create(product: product, quantity: 1, price: product.price)
---
UPDATE "lineitems" SET "quantity" = $1, "updated_at" = $2 WHERE "lineitems"."id" = $3  [["quantity", 2], ["updated_at", "2023-01-04 20:10:59.273440"], ["id", 7]]
INSERT INTO "lineitems" ("product_id", "cart_id", "quantity", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["product_id", 1], ["cart_id", 9], ["quantity", 1], ["price", "20.0"], ["created_at", "2023-01-04 21:31:50.773535"], ["updated_at", "2023-01-04 21:31:50.773535"]]