HW7/app/controllers/api/v1/articles_controller.rb

  def create
    @article = @author.articles.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Jorge 3"], ["body", "body my body"], ["created_at", "2022-11-30 14:28:11.863369"], ["updated_at", "2022-11-30 14:28:11.863369"], ["author_id", 3]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["title", "My title (new)"], ["body", "My body (new)"], ["updated_at", "2022-12-10 14:07:47.017248"], ["id", 1]]

  def destroy
    if @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]

  def set_author
    @author = Author.find(params[:author_id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]