HW7/app/controllers/api/v1/authors_controller.rb

  def index
    render json: Author.all
---
SELECT "authors".* FROM "authors"

  def create
    @author = Author.create(author_params)
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Stiv Woznjak"], ["created_at", "2022-12-10 14:01:03.819803"], ["updated_at", "2022-12-10 14:01:03.819803"]]

  def update
    @author = Author.find(params[:id])
    @author.update(author_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "authors" SET "name" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["name", "Jorge 333"], ["updated_at", "2022-12-07 14:00:02.684705"], ["id", 3]]

  def destroy
    if @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 7]]