HW7/app/controllers/api/v1/comments_controller.rb

  def index
    @comments = @author.comments
    @comments = @author.comments.where(status: params[:status]) if comment_params[:status].present?
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 AND "comments"."status" IS NULL  [["author_id", 1]]

  def create
    comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("body", "status", "author_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "My first comment"], ["status", 0], ["author_id", 1], ["article_id", 1], ["created_at", "2022-12-10 14:31:02.643066"], ["updated_at", "2022-12-10 14:31:02.643066"]]

  def update
    if @comment.update(comment_params)
---
UPDATE "comments" SET "body" = $1, "status" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["body", "My first comment (new)"], ["status", 1], ["updated_at", "2022-12-10 14:41:43.805527"], ["id", 1]]

  def destroy
    if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]

  def set_article
    if comment_params[:article_id].is_a?(Integer)
      @article = Article.find(comment_params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_comment
    @comment = @author.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["author_id", 1], ["id", 1], ["LIMIT", 1]]

  def set_author
    @author = Author.find(params[:author_id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]