HW7/app/controllers/api/v1/likes_controller.rb

      def create
        @like = where_is_like.likes.create(params)
---
INSERT INTO "likes" ("author_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["likeable_type", "Comment"], ["likeable_id", 3], ["created_at", "2022-12-10 17:19:09.952973"], ["updated_at", "2022-12-10 17:19:09.952973"]]

      def destroy
        if @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]

      def set_comment
        @comment = Comment.find(params[:comment_id]) if params[:comment_id].present?
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      def set_article
        @article = Article.find(params[:article_id]) if params[:article_id].present?
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]