HW9/app/serializers/api/V1/article_serializer.rb

  def author
    Author.find(object.author_id).name
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]