HW12/app/controllers/orders_controller.rb

  def create
    order = current_user.orders.create(cart: current_cart, status: 0)
---
INSERT INTO "orders" ("cart_id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 8], ["user_id", 3], ["status", nil], ["created_at", "2023-01-04 21:31:23.083208"], ["updated_at", "2023-01-04 21:31:23.083208"]]

  def show
    @order = current_user.orders.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]

  def index
    @orders = current_user.orders.all
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 3]]

  def pay
    order = current_user.orders.find(params[:id])
    order.status = 1
    order.save
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "Paid"], ["updated_at", "2023-01-04 22:28:56.252666"], ["id", 1]]