HW9/app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 AND "comments"."status" IS NULL  [["author_id", 1]]
---
  def index
    @comments = @author.comments
    # debugger
    @comments = @author.comments.where(status: params[:status]) if comment_params[:status].blank?

INSERT INTO "comments" ("body", "status", "author_id", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "My first comment 5"], ["status", 0], ["author_id", 1], ["article_id", 1], ["created_at", "2022-12-14 14:11:11.490880"], ["updated_at", "2022-12-14 14:11:11.490880"]]
---
  def create
    comment = @author.comments.create(comment_params)

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "My first comment 5"], ["updated_at", "2022-12-10 15:14:07.302264"], ["id", 3]]
---
  def update
    if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    if @comment.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_article
    if comment_params[:article_id].is_a?(Integer)
      @article = Article.find(comment_params[:article_id])

SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["author_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_comment
    @comment = @author.comments.find(params[:id])

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_author
    @author = Author.find(params[:author_id])