HW11/app/controllers/lineitems_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    product = Product.find(params[:product_id])

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lineitems" WHERE "lineitems"."id" = $1  [["id", 2]]
---
  def destroy
    lineitem = Lineitem.find(params[:id])
    lineitem.destroy