HW11/app/controllers/orders_controller.rb

INSERT INTO "orders" ("cart_id", "user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 8], ["user_id", 3], ["status", nil], ["created_at", "2023-01-04 21:31:23.083208"], ["updated_at", "2023-01-04 21:31:23.083208"]]
---
  def create
    order = current_user.orders.create(cart: current_cart, status: "Not Paid")

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
  def show
    @order = current_user.orders.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def index
    @orders = current_user.orders.all