HW11/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @products = Product.all
    @products = Category.find(params[:category_id]).products if params[:category_id].present?