HW15/app/views/carts/show.html.erb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = $1  [["cart_id", 8]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = $1 LIMIT $2  [["cart_id", 1], ["LIMIT", 1]]
---
    <div class="row gx-4 gx-lg-5 row-cols-2 row-cols-md-3 row-cols-xl-4 justify-content-center">
      <% if current_cart.lineitems.any? %>